pzb568/esp32c6/sdkconfig.defaults
# ═══════════════════════════════════════════════════
#  sdkconfig.defaults — ESP32-C6 智能家庭终端
#  ESP-IDF v5.2+ 兼容
# ═══════════════════════════════════════════════════

# ── 目标芯片 ────────────────────────────────────
CONFIG_IDF_TARGET="esp32c6"

# ── CPU 频率 ─────────────────────────────────────
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# ── Flash ────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ── 分区表 ───────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── FreeRTOS ─────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=y

# ── WiFi ─────────────────────────────────────────
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP32_WIFI_NVS_ENABLED=y

# ── HTTPS / TLS ──────────────────────────────────
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# ── MQTT ─────────────────────────────────────────
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_BUFFER_SIZE=4096
CONFIG_MQTT_OUTBOX_EXPIRED_TIMEOUT_MS=30000

# ── I2S (麦克风 + 功放) ──────────────────────────
CONFIG_SOC_I2S_SUPPORTED=y
CONFIG_SOC_I2S_NUM=2

# ── RMT (红外发射) ───────────────────────────────
CONFIG_SOC_RMT_SUPPORTED=y

# ── HTTP Server ──────────────────────────────────
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=256

# ── 日志 ─────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# ── 内存 ─────────────────────────────────────────
CONFIG_ESP32C6_SPIRAM_SUPPORT=n
CONFIG_HEAP_POISONING_DISABLED=y

# ── SPIFFS (音频文件存储) ─────────────────────────
CONFIG_SPIFFS_MAX_PARTITIONS=1
CONFIG_SPIFFS_USE_MAGIC=y

# ── NVS ──────────────────────────────────────────
CONFIG_NVS_ENCRYPTION=n
